#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
[0m[33mRunning plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/kylesbx/tstapp-kyle-gcs-prod/runs/run-GLUTEFyK2dkRE7US[0m
[0m
Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # google_compute_firewall.allow-http[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_firewall" "allow-http" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdestination_ranges[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdirection[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0menable_logging[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "prod-network-allow-http"
      [32m+[0m [0m[1m[0mnetwork[0m[0m            = "prod-network"
      [32m+[0m [0m[1m[0mpriority[0m[0m           = 1000
      [32m+[0m [0m[1m[0mproject[0m[0m            = "tstapp-kyle-gcs-prod"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msource_ranges[0m[0m      = [
          [32m+[0m [0m"0.0.0.0/0",
        ]
      [32m+[0m [0m[1m[0mtarget_tags[0m[0m        = [
          [32m+[0m [0m"http-server",
        ]

      [32m+[0m [0mallow {
          [32m+[0m [0m[1m[0mports[0m[0m    = [
              [32m+[0m [0m"80",
            ]
          [32m+[0m [0m[1m[0mprotocol[0m[0m = "tcp"
        }
    }

[1m  # google_compute_firewall.allow-ssh[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_firewall" "allow-ssh" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdestination_ranges[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdirection[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0menable_logging[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "prod-network-allow-ssh"
      [32m+[0m [0m[1m[0mnetwork[0m[0m            = "prod-network"
      [32m+[0m [0m[1m[0mpriority[0m[0m           = 1000
      [32m+[0m [0m[1m[0mproject[0m[0m            = "tstapp-kyle-gcs-prod"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msource_ranges[0m[0m      = [
          [32m+[0m [0m"0.0.0.0/0",
        ]
      [32m+[0m [0m[1m[0mtarget_tags[0m[0m        = [
          [32m+[0m [0m"http-server",
        ]

      [32m+[0m [0mallow {
          [32m+[0m [0m[1m[0mports[0m[0m    = [
              [32m+[0m [0m"22",
            ]
          [32m+[0m [0m[1m[0mprotocol[0m[0m = "tcp"
        }
    }

[1m  # google_compute_instance.http_server[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_instance" "http_server" {
      [32m+[0m [0m[1m[0mallow_stopping_for_update[0m[0m = true
      [32m+[0m [0m[1m[0mcan_ip_forward[0m[0m            = false
      [32m+[0m [0m[1m[0mcpu_platform[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mcurrent_status[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mdeletion_protection[0m[0m       = false
      [32m+[0m [0m[1m[0mguest_accelerator[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0minstance_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mmachine_type[0m[0m              = "f1-micro"
      [32m+[0m [0m[1m[0mmetadata_fingerprint[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmetadata_startup_script[0m[0m   = "sudo apt-get update && sudo apt-get install apache2 -y && echo '<html><body><h1>Environment: prod</h1></body></html>' | sudo tee /var/www/html/index.html"
      [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                      = "prod-apache2-instance"
      [32m+[0m [0m[1m[0mproject[0m[0m                   = "tstapp-kyle-gcs-prod"
      [32m+[0m [0m[1m[0mself_link[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                      = [
          [32m+[0m [0m"http-server",
        ]
      [32m+[0m [0m[1m[0mtags_fingerprint[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mzone[0m[0m                      = "us-east4-b"

      [32m+[0m [0mboot_disk {
          [32m+[0m [0m[1m[0mauto_delete[0m[0m                = true
          [32m+[0m [0m[1m[0mdevice_name[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mdisk_encryption_key_sha256[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_self_link[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmode[0m[0m                       = "READ_WRITE"
          [32m+[0m [0m[1m[0msource[0m[0m                     = (known after apply)

          [32m+[0m [0minitialize_params {
              [32m+[0m [0m[1m[0mimage[0m[0m  = "debian-cloud/debian-9"
              [32m+[0m [0m[1m[0mlabels[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0msize[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mtype[0m[0m   = (known after apply)
            }
        }

      [32m+[0m [0mconfidential_instance_config {
          [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m = (known after apply)
        }

      [32m+[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0mipv6_access_type[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mnetwork[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_ip[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mstack_type[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork[0m[0m         = "prod-subnet-01"
          [32m+[0m [0m[1m[0msubnetwork_project[0m[0m = (known after apply)

          [32m+[0m [0maccess_config {
              [32m+[0m [0m[1m[0mnat_ip[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mnetwork_tier[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mreservation_affinity {
          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)

          [32m+[0m [0mspecific_reservation {
              [32m+[0m [0m[1m[0mkey[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mscheduling {
          [32m+[0m [0m[1m[0mautomatic_restart[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mmin_node_cpus[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mon_host_maintenance[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mpreemptible[0m[0m         = (known after apply)

          [32m+[0m [0mnode_affinities {
              [32m+[0m [0m[1m[0mkey[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0moperator[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m   = (known after apply)
            }
        }
    }

[1m  # module.vpc.module.subnets.google_compute_subnetwork.subnetwork["us-east4/prod-subnet-01"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_subnetwork" "subnetwork" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mexternal_ipv6_prefix[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mfingerprint[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mgateway_address[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mip_cidr_range[0m[0m              = "10.20.10.0/24"
      [32m+[0m [0m[1m[0mipv6_cidr_range[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                       = "prod-subnet-01"
      [32m+[0m [0m[1m[0mnetwork[0m[0m                    = "prod-network"
      [32m+[0m [0m[1m[0mprivate_ip_google_access[0m[0m   = false
      [32m+[0m [0m[1m[0mprivate_ipv6_google_access[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                    = "tstapp-kyle-gcs-prod"
      [32m+[0m [0m[1m[0mpurpose[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                     = "us-east4"
      [32m+[0m [0m[1m[0msecondary_ip_range[0m[0m         = []
      [32m+[0m [0m[1m[0mself_link[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mstack_type[0m[0m                 = (known after apply)
    }

[1m  # module.vpc.module.vpc.google_compute_network.network[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_network" "network" {
      [32m+[0m [0m[1m[0mauto_create_subnetworks[0m[0m         = false
      [32m+[0m [0m[1m[0mdelete_default_routes_on_create[0m[0m = false
      [32m+[0m [0m[1m[0mgateway_ipv4[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mmtu[0m[0m                             = 0
      [32m+[0m [0m[1m[0mname[0m[0m                            = "prod-network"
      [32m+[0m [0m[1m[0mproject[0m[0m                         = "tstapp-kyle-gcs-prod"
      [32m+[0m [0m[1m[0mrouting_mode[0m[0m                    = "GLOBAL"
      [32m+[0m [0m[1m[0mself_link[0m[0m                       = (known after apply)
    }

[0m[1mPlan:[0m 5 to add, 0 to change, 0 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "GOOGLE_CREDENTIALS" but
[33m│[0m [0ma value was found in file "/terraform/terraform.tfvars". If you meant to
[33m│[0m [0muse this value, add a "variable" block to the configuration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
```
</details>
*Pusher: @kyalders, Action: `pull_request`*